sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    clear();

#if DEBUG
    if (length) {
        System::Firmware::setElfHash(hashCopy);
    }
#endif

    auto deviceName = defaultDeviceName();

    System::Flags::defaults();
    System::Firmware::defaults();
    System::Device::defaults();
    System::Device::setName(deviceName);
    System::Device::setTitle(FSPGM(KFC_Firmware, "KFC Firmware"));
    System::Device::setPassword(FSPGM(defaultPassword, "12345678"));
    System::WebServer::defaults();
    Network::WiFi::setSSID(deviceName);
    Network::WiFi::setPassword(FSPGM(defaultPassword));
    Network::WiFi::setSoftApSSID(deviceName);
    Network::WiFi::setSoftApPassword(FSPGM(defaultPassword));
    Network::Settings::defaults();
    Network::SoftAP::defaults();

#if MQTT_SUPPORT
    Plugins::MQTTClient::defaults();
#endif
#if HOME_ASSISTANT_INTEGRATION
    Plugins::HomeAssistant::defaults();
#endif
#if IOT_REMOTE_CONTROL
    Plugins::RemoteControl::defaults();
#endif
#if SERIAL2TCP_SUPPORT
    Plugins::Serial2TCP::defaults();
#endif
#if SYSLOG_SUPPORT
    Plugins::SyslogClient::defaults();
#endif
#if NTP_CLIENT
    Plugins::NTPClient::defaults();
#endif
#if IOT_ALARM_PLUGIN_ENABLED
    Plugins::Alarm::defaults();
#endif
#if IOT_WEATHER_STATION
    Plugins::WeatherStation::defaults();
#endif
#if IOT_SENSOR
    Plugins::Sensor::defaults();
#endif
#if IOT_BLINDS_CTRL
    Plugins::Blinds::defaults();
#endif
#if PING_MONITOR_SUPPORT
    Plugins::Ping::defaults();
#endif
#if IOT_DIMMER_MODULE || IOT_ATOMIC_SUN_V2
    Plugins::Dimmer::defaults();
#endif
#if IOT_CLOCK
    Plugins::Clock::defaults();
#endif

#if CUSTOM_CONFIG_PRESET
    customSettings();
#endif
    WebUIAlerts_notice(F("Factory settings restored"));
}

#if CUSTOM_CONFIG_PRESET
    // set CUSTOM_CONFIG_PRESET to 0 if no custom config is being used
    #include "retracted/custom_config.h"
#endif

void KFCFWConfiguration::setLastError(const String &error)
{
    _lastError = error;
}

const char *KFCFWConfiguration::getLastError() const
{
    return _lastError.c_str();
}

void KFCFWConfiguration::gc()
{
    if (_readAccess && millis() > _readAccess + _garbageCollectionCycleDelay) {
        // _debug_println(F("KFCFWConfiguration::gc(): releasing memory"));
        release();
    }
}

void KFCFWConfiguration::setConfigDirty(bool dirty)
{
    _dirty = dirty;
}

bool KFCFWConfiguration::isConfigDirty() const
{
    return _dirty;
}

const char __compile_date__[] PROGMEM = { __DATE__ };

const String KFCFWConfiguration::getFirmwareVersion()
{
#if DEBUG
#if ESP8266
    return getShortFirmwareVersion() + F("." ARDUINO_ESP8266_RELEASE " " ) + FPSTR(__compile_date__);
#else
    return getShortFirmwareVersion() + ' ' + FPSTR(__compile_date__);
#endif

#else // #if DEBUG
    return getShortFirmwareVersion() + ' ' + FPSTR(__compile_date__);
#endif
}

const __FlashStringHelper *KFCFWConfiguration::getShortFirmwareVersion_P()
{
    return F(FIRMWARE_VERSION_STR " Build " __BUILD_NUMBER);
}

const String KFCFWConfiguration::getShortFirmwareVersion()
{
    return getShortFirmwareVersion_P();
}

#if ENABLE_DEEP_SLEEP

void KFCFWConfiguration::storeQuickConnect(const uint8_t *bssid, int8_t channel)
{
    __LDBG_printf("bssid=%s channel=%d", mac2String(bssid).c_str(), channel);

    Config_QuickConnect::WiFiQuickConnect_t quickConnect;
    RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId, &quickConnect, sizeof(quickConnect));
    quickConnect.channel = channel;
    memcpy(quickConnect.bssid, bssid, WL_MAC_ADDR_LENGTH);
    RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId, &quickConnect, sizeof(quickConnect));
}

void KFCFWConfiguration::storeStationConfig(uint32_t ip, uint32_t netmask, uint32_t gateway)
{
    __LDBG_printf("ip=%s netmask=%s gw=%s dhcp=%u",
        IPAddress(ip).toString().c_str(),
        IPAddress(netmask).toString().c_str(),
        IPAddress(gateway).toString().c_str(),
        (wifi_station_dhcpc_status() == DHCP_STARTED)
    );

    Config_QuickConnect::WiFiQuickConnect_t quickConnect;
    if (RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId, &quickConnect, sizeof(quickConnect))) {
        quickConnect.local_ip = ip;
        quickConnect.subnet = netmask;
        quickConnect.gateway = gateway;
        quickConnect.dns1 = (uint32_t)WiFi.dnsIP();
        quickConnect.dns2 = (uint32_t)WiFi.dnsIP(1);
        auto flags = System::Flags::getConfig();
        quickConnect.use_static_ip = flags.useStaticIPDuringWakeUp || !flags.stationModeDHCPEnabled;
        RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId, &quickConnect, sizeof(quickConnect));
    } else {
        _debug_println(F("reading RTC memory failed"));
    }
}

#endif

void KFCFWConfiguration::setup()
{
    String version = KFCFWConfiguration::getFirmwareVersion();
#if ENABLE_DEEP_SLEEP
    if (!resetDetector.hasWakeUpDetected())
#endif
    {
        Logger_notice(F("Starting KFCFW %s"), version.c_str());
        BlinkLEDTimer::setBlink(__LED_BUILTIN, BlinkLEDTimer::FLICKER);
    }

    // ~5ms
    rng.begin(version.c_str());
    uint8_t mac[WL_MAC_ADDR_LENGTH];
    rng.stir(WiFi.macAddress(mac), WL_MAC_ADDR_LENGTH);
    auto channel = WiFi.channel();
    rng.stir((const uint8_t *)&channel, sizeof(channel));
    rng.stir((const uint8_t *)&config, sizeof(config));

    LoopFunctions::add(KFCFWConfiguration::loop);
}

#include "build.h"

void KFCFWConfiguration::read()
{
    __LDBG_println();

    BOOTLOG_PRINTF("read config");

    if (!Configuration::read()) {
        BOOTLOG_PRINTF("failed");

        Logger_error(F("Failed to read configuration, restoring factory settings"));
        config.restoreFactorySettings();
        Configuration::write();
    } else {
        auto version = System::Device::getConfig().config_version;
        BOOTLOG_PRINTF("version %08x", version);
        uint32_t currentVersion = (FIRMWARE_VERSION << 16) | (uint16_t)String(F(__BUILD_NUMBER)).toInt();
        if (currentVersion != version) {
            uint16_t build = version;
            version >>= 16;
            Logger_warning(F("Upgrading EEPROM settings from %d.%d.%d.%u to " FIRMWARE_VERSION_STR "." __BUILD_NUMBER), (version >> 16), (version >> 8) & 0xff, (version & 0xff), build);
            System::Device::getWriteableConfig().config_version = currentVersion;
            config.recoveryMode(false);
            Configuration::write();
            SaveCrash::clearEEPROM();
        }
    }
}

void KFCFWConfiguration::write()
{
    __LDBG_println();

