sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    delay(1);

    for(auto plugin: plugins) {
        plugin->prepareDeepSleep(time.count());
    }
    if (delayAfterPrepare) {
        delay(delayAfterPrepare);
    }
    __LDBG_printf("Entering deep sleep for %d milliseconds, RF mode %d", time.count(), mode);

#if __LED_BUILTIN == -3
    BlinkLEDTimer::setBlink(__LED_BUILTIN, BlinkLEDTimer::OFF);
#endif

#if defined(ESP8266)
    ESP.deepSleep(time.count() * 1000ULL, mode);
    ESP.deepSleep(0, mode); // if the first attempt fails try with 0
#else
    ESP.deepSleep(time.count() * 1000UL);
    ESP.deepSleep(0);
#endif
}

#endif

static uint32_t restart_device_timeout;

static void invoke_ESP_restart()
{
#if __LED_BUILTIN == -3
    BlinkLEDTimer::setBlink(__LED_BUILTIN, BlinkLEDTimer::OFF);
#endif
    ESP.restart();
}

static void restart_device()
{
    if (millis() > restart_device_timeout) {
        _debug_println();
        invoke_ESP_restart();
    }
}

#if PIN_MONITOR
#include "pin_monitor.h"
#endif

void KFCFWConfiguration::restartDevice(bool safeMode)
{
    _debug_println();

    String msg = F("Device is being restarted");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    BlinkLEDTimer::setBlink(__LED_BUILTIN, BlinkLEDTimer::FLICKER);

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    if (_safeMode) {
        invoke_ESP_restart();
    }

    // clear queue silently
    ADCManager::terminate(false);

    __LDBG_printf("Scheduled tasks %u, WiFi callbacks %u, Loop Functions %u", _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());

    auto webUiSocket = WsWebUISocket::getWsWebUI();
    if (webUiSocket) {
        debug_printf_P(PSTR("websocket %p\n"), webUiSocket);
        webUiSocket->shutdown();
    }

    // execute in reverse order
    for(auto iterator = plugins.rbegin(); iterator != plugins.rend(); ++iterator) {
        const auto plugin = *iterator;
        debug_printf("plugin=%s\n", plugin->getName_P());
        plugin->shutdown();
        plugin->clearSetupTime();
    }

    __LDBG_printf("After plugins: Scheduled tasks %u, WiFi callbacks %u, Loop Functions %u", _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());

#if PIN_MONITOR
    pinMonitor.end();
#endif
    WiFiCallbacks::clear();
    LoopFunctions::clear();
    __Scheduler.end();

    // give system time to finish all tasks
    restart_device_timeout = millis() + 250;
    LoopFunctions::add(restart_device);
}

void KFCFWConfiguration::loop()
{
    rng.loop();
    config.gc();
}

uint8_t KFCFWConfiguration::getMaxWiFiChannels()
{
    wifi_country_t country;
    if (!wifi_get_country(&country)) {
        country.nchan = 255;
    }
    return country.nchan;
}

String KFCFWConfiguration::getWiFiEncryptionType(uint8_t type)
{
#if defined(ESP32)
    switch(type) {
        case WIFI_AUTH_OPEN:
            return F("open");
        case WIFI_AUTH_WEP:
            return F("WEP");
        case WIFI_AUTH_WPA_PSK:
            return F("WPA/PSK");
        case WIFI_AUTH_WPA2_PSK:
            return F("WPA2/PSK");
        case WIFI_AUTH_WPA_WPA2_PSK:
            return F("WPA/WPA2/PSK");
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return F("WPA2/ENTERPRISE");
    }
#elif defined(ESP8266)
    switch(type) {
        case ENC_TYPE_NONE:
            return F("open");
        case ENC_TYPE_WEP:
            return F("WEP");
        case ENC_TYPE_TKIP:
            return F("WPA/PSK");
        case ENC_TYPE_CCMP:
            return F("WPA2/PSK");
        case ENC_TYPE_AUTO:
            return F("auto");
    }
#endif
    return F("N/A");
}

bool KFCFWConfiguration::reconfigureWiFi()
{
    _debug_println();
    BOOTLOG_PRINTF("reconfigure WiFi");

    WiFi.persistent(false); // disable during disconnects since it saves the configuration
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(true);
    WiFi.softAPdisconnect(true);
    WiFi.persistent(true);

    return connectWiFi();
}

bool KFCFWConfiguration::connectWiFi()
{
    __LDBG_println();
    BOOTLOG_PRINTF("connecting to WiFi");
    setLastError(String());

    bool station_mode_success = false;
    bool ap_mode_success = false;

    auto flags = System::Flags::getConfig();
    if (flags.is_station_mode_enabled) {
        BOOTLOG_PRINTF("init station mode");
        __LDBG_print("init station mode");
        WiFi.setAutoConnect(false); // WiFi callbacks have to be installed first during boot
        WiFi.setAutoReconnect(true);

        auto network = Network::Settings::getConfig();

        bool result;
        if (flags.is_station_mode_dhcp_enabled) {
            result = WiFi.config((uint32_t)0, (uint32_t)0, (uint32_t)0, (uint32_t)0, (uint32_t)0);
        } else {
            result = WiFi.config(network.getLocalIp(), network.getGateway(), network.getSubnet(), network.getDns1(), network.getDns2());
        }
        if (!result) {
            PrintString message;
            message.printf_P(PSTR("Failed to configure Station Mode with %s"), flags.is_station_mode_dhcp_enabled ? PSTR("DHCP") : PSTR("static address"));
            setLastError(message);
            Logger_error(message);
        } else {

            if (WiFi.begin(Network::WiFi::getSSID(), Network::WiFi::getPassword()) == WL_CONNECT_FAILED) {
                String message = F("Failed to start Station Mode");
                setLastError(message);
                Logger_error(message);
            } else {
                __LDBG_printf("Station Mode SSID %s", Network::WiFi::getSSID());
                station_mode_success = true;
            }
        }
    }
    else {
        __LDBG_print("disabling station mode");
        WiFi.disconnect(true);
        station_mode_success = true;
    }

    if (flags.is_softap_enabled) {
        BOOTLOG_PRINTF("init AP mode");
        __LDBG_print("init AP mode");

        auto softAp = Network::SoftAP::getConfig();
        BOOTLOG_PRINTF("config=%p size=%u", &softAp, sizeof(softAp));

        BOOTLOG_PRINTF("WiFi.softAPConfig");
        if (!WiFi.softAPConfig(softAp.getAddress(), softAp.getGateway(), softAp.getSubnet())) {
            BOOTLOG_PRINTF("failed");
            String message = F("Cannot configure AP mode");
            setLastError(message);
            Logger_error(message);
        } else {

#if defined(ESP32)

